smarttools/app/controllers/administrators_controller.rb

SELECT "administrators".* FROM "administrators"
---
  def index
    @administrators = Administrator.all

INSERT INTO "administrators" ("nombre", "apellido", "correo", "contrasena", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "A"], ["apellido", "A"], ["correo", "a@a.a"], ["contrasena", "a"], ["created_at", "2015-09-18 22:31:36.041905"], ["updated_at", "2015-09-18 22:31:36.041905"]]
---
  def create
    @administrator = Administrator.new(administrator_params)
    respond_to do |format|
      if @administrator.save

UPDATE "administrators" SET "nombre" = $1, "updated_at" = $2 WHERE "administrators"."id" = $3  [["nombre", "E"], ["updated_at", "2015-09-18 22:31:50.010090"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @administrator.update(administrator_params)

DELETE FROM "administrators" WHERE "administrators"."id" = $1  [["id", 2]]
---
  def destroy
    @administrator.destroy

SELECT  "administrators".* FROM "administrators" WHERE "administrators"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_administrator
      @administrator = Administrator.find(params[:id])