smarttools/app/controllers/session_controller.rb

  def create
  	admin = Administrator.find_by(correo: params[:session][:correo].downcase);
---
SELECT  "administrators".* FROM "administrators" WHERE "administrators"."correo" = $1 LIMIT 1  [["correo", "a@a.a"]]